Мюнцкабинент_30/src/AccumulationRegisters/ПродажаМонет/ПродажаМонет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПродажаМонет</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Монеты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коллекция</name>
    <type>
      <types>CatalogRef.Коллекции</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Мюнцкабинент_30/src/AccumulationRegisters/ПродажаМонет/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	ВалютаУчета = Константы.ОсновнаяУчетнаяВалюта.Получить();
	
	Для Каждого ТекЗапись ИЗ ЭтотОбъект цикл
		Если (НЕ ВалютаУчета.Пустая()) И (ТекЗапись.Валюта <> ВалютаУчета) Тогда 
			// надо прессчитать из валюты в  основную учетную валюту
			СуммаВВалютеУчета 		= РаботаСКурсамиВалют.ПересчитатьВВалюту (ТекЗапись.Сумма, ТекЗапись.Валюта, ВалютаУчета, ТекЗапись.Период);
			ТекЗапись.ВалютнаяСумма = ТекЗапись.Сумма;
			ТекЗапись.Сумма			= СуммаВВалютеУчета;
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры
